Revit 2026 API

# PerformanceAdviserRules Class

---

Provides a container of all Revit built-in PerformanceAdviserRuleId instances.

SystemObject Autodesk.Revit.DBPerformanceAdviserRules

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class PerformanceAdviserRules
```
```vb
Public NotInheritable Class PerformanceAdviserRules
```
```cpp
public ref class PerformanceAdviserRules abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PerformanceAdviserRules = class end
```

#### Reference

Autodesk.Revit.DB Namespace